[
    {
        "id": 1,
        "name": "IFMaker System",
        "keywords": ["Angular", "Typescript", "RxJs", "LESS"],
        "resume": "A system of material management and access control for Federal Institute Farroupilha maker laboratories",
        "description": "<p>At the Maker Lab of the Farroupilha Federal Institute - São Vicente do Sul Campus, the lack of a material and access control system has been causing difficulties in locating materials and the entry of unidentified persons. This work proposes the development of a web solution for stock management for the maker lab. The solution aims to manage material reservations, replacing the manual methods and online spreadsheets currently used, through the development of two applications. The theoretical framework addresses concepts of web applications such as Single-Page Applications (SPAs) and Application Programming Interface (API), in addition, similar stock control projects are discussed to support the development of the proposed applications.</p>",
        "skills": ["Angular Routing", "Input, Output Events", "Forms Module", "HTTPClient", "RxJs", "Lazy Loading"],
        "sourceCodeUrl": "https://github.com/sougabriel/ifmaker-system",
        "viewUrl": "",
        "imageUrl": "/images/projects/ifmaker-system.svg",
        "contributors": [""]
    },
    {
        "id": 2,
        "name": "IFMaker API",
        "keywords": ["MySQL", "Javascript", "ExpressJS", "Sequelize"],
        "resume": "A RESTful Application Programming Interface (API) for Federal Institute Farroupilha maker laboratories system",
        "description": "<p>The goal of this project was to meet the needs of the Maker Lab at the Instituto Federal Farroupilha Campus in São Vicente do Sul. By developing a web API, it was designed to facilitate the management of people, users, projects, materials, and access within the lab, creating a more organized and efficient environment.</p><p>The API was structured to perform various operations efficiently. Among its functionalities are the ability to retrieve information about people, users, projects, materials, and lab access. Additionally, the API allows for the addition of new records in these contexts, the updating of existing information, and the removal of records. In this way, resource and personnel management in the lab is simplified and centralized.</p><p>To ensure the project's maintainability and scalability, I organized the repository following the principles of clean architecture. This approach offers a clear separation between the different layers of the application, facilitating modifications without compromising system stability. In the repository, models define the database tables with their respective columns and attributes. Controllers are responsible for handling HTTP requests and coordinating interactions between routes. Routes define the paths for the requests and associate them with the corresponding controllers. At the root layer, there is the main server.js file, responsible for starting the server, along with the .env file, which contains the environment variables necessary for project configuration.</p>",
        "skills": ["Clean Architecture", "NodeJs Server", "RESTful API"],
        "sourceCodeUrl": "https://github.com/sougabriel/ifmaker-api",
        "viewUrl": "",
        "imageUrl": "/images/projects/ifmaker-api.svg",
        "contributors": [""]
    },
    {
        "id": 3,
        "name": "SpaceDagger",
        "keywords": ["Javascript", "JQuery", "CSS", "Web Game"],
        "resume": "A simple pixelart rhythm game of spaceships made with Javascript and JQuery.",
        "description": "<p>In this project I developed a rhythm game with Javascript, HTML and CSS. Using the JQuery library to capture the elements and perform the user's keyboard events.</p><p>I developed this project during my graduation.</p>",
        "skills": ["Keyboard Events", "Interval Function", "Countdown"],
        "sourceCodeUrl": "https://github.com/sougabriel/spaceDagger-js",
        "viewUrl": "https://sougabriel.github.io/projects/spacedagger/index.html",
        "imageUrl": "/images/projects/space-dagger.webp",
        "contributors": [""]
    },
    {
        "id": 4,
        "name": "Simple Calculator Js",
        "keywords": ["Javascript", "HTML", "CSS"],
        "resume": "A simple calculator made with pure Javascript and without eval function.",
        "description": "<p>In this project I made a simple calculator with Javascript without using the eval function. Using only array methods to make all the features and CSS focused on the application's responsiveness.</p><p>I developed this project during my graduation.</p>",
        "skills": ["Arrays Methods", "Javascript", "Responsive Design"],
        "sourceCodeUrl": "https://github.com/sougabriel/simple-calculator-js",
        "viewUrl": "https://sougabriel.github.io/projects/simplecalc/index.html",
        "imageUrl": "/images/projects/simple-calculator-js.webp",
        "contributors": [""]
    },
    {
        "id": 5,
        "name": "BMI Calculator",
        "keywords": ["Javascript", "AngularJS", "Bootstrap"],
        "resume": "A simple page for calculate BMI using AngularJS and Bootstrap.",
        "description": "<p>Using the AngularJs library to learn its base concepts for a future college project, I developed this Body Mass Index (BMI) calculator.</p>",
        "skills": [""],
        "sourceCodeUrl": "https://github.com/sougabriel/BMI-CalculatorJs",
        "viewUrl": "https://sougabriel.github.io/projects/bmicalc/index.html",
        "imageUrl": "/images/projects/bmi-calculator.webp",
        "contributors": [""]
    },
    {
        "id": 6,
        "name": "Directory View PHP",
        "keywords": ["PHP", "CSS", "List Directories"],
        "resume": "This is a php index file to customize your user or php web server. This code will list all folders in your base server directory.",
        "description": "<p>In this simple project I used PHP to read the directories in the root folder of the 'index.php' file. Mixing concepts of loops and arrays to generate page content and a responsive design with pure CSS.</p>",
        "skills": ["PHP", "CSS"],
        "sourceCodeUrl": "https://github.com/sougabriel/index-phpserver",
        "viewUrl": "",
        "imageUrl": "/images/projects/directory-php.webp",
        "contributors": [""]
    }
]
